const { createApp } = Vue;

createApp({
  data() {
    return {
      athkar: ["الصباح", "المساء", "خارج الوقت"],
      index: 0,
      nahar: 0,
      sabah: [
        {
          name: "استغفر الله العظيم الذي لا إله إلا هو الحي القيوم و أتوب إليه",
          num: 3,
        },
        {
          name: "اللهم أنت السلام و منك السلام تباركت ذا الجلال و الاكرام، اللهم أعني على ذكرك و شكرك و حسن عبادتك و لا تجعلني من الغافلين",
          num: 1,
        },
        {
          name: "لا إله إلا الله وحده لا شريك له، له الملك و له الحمد و هو على كل شيء قدير",
          num: 10,
        },


        {
          name: "اللهم أجرنا من النار",
          num: 7,
        },

        {
          name: "اللهم إنا نسألك رضاك و الجنة",
          num: 8,
        },

        {
          name: "و نعوذ بك من سخطك و عذابك و النار",
          num: 1,
        },

// ==============================

        {
          name: "اللهـمَّ أَنتَ ربِّي, لا إلهَ إلا أنتَ, خَلَقْتَني, وأَنا عبدُكَ, وأَنا على عهدِكَ ووعدِكَ, ما استَطَعْتُ, أعـوذُ بـكَ مِن شرِّ ما صَنَعْتُ, أبوءُ لكَ بنِعْمَتِكَ عليِّ, وأَبوءُ لَكَ بذَنبي, فاغفِرْ لي, فإنَّه لا يَغفِرُ الذُّنوبَ إلا أَنتَ",
          num: 3,
        },

        {
          name: "اللَّهمَّ إنِّي أصبحتُ أشْهدُكَ وأشْهدُ حملةَ عرشِكَ وملائِكتَكَ وجميعَ خلقِكَ أنَّكَ أنتَ اللَّهُ لا إلَهَ إلَّا أنتَ وحدَكَ لا شريكَ لَكَ وأنَّ محمَّدًا عبدُكَ ورسولُكَ",
          num: 4,
        },

        {
          name: "اللَّهمَّ ما أصبحَ بي من نِعمةٍ أو بأحدٍ من خلقِك فمنكَ وحدَك، لا شريكَ لَك، فلَك الحمدُ، ولَك الشُّكرُ",
          num: 3,
        },

        {
          name: "اللَّهمَّ إني أصبَحتُ منكَ في نعمةٍ وعافيةٍ وسِترٍ ، فأتِمَّ علَيَّ نِعمَتَكَ وعافيتَكَ وسِترَكَ في الدُّنيا والآخرةِ",
          num: 3,
        },

        {
          name: "اللهمّ عَافِنِي في بَدَنِي, اللهُمَّ عَافِنِي في سَمعِي, اللَّهُمَّ عِافِنِي في بصَري, لا إلهَ إلا أنت",
          num: 3,
        },



        {
          name: "بسم الله على نفسي وأهلي ومالي",
          num: 3,
        },

        {
          name: "اللَّهُمَّ إنِّي أعُوذُ بكَ مِنَ الهَمِّ والحَزَنِ، والعَجْزِ والكَسَلِ، والجُبْنِ والبُخْلِ، وضَلَعِ الدَّيْنِ، وغَلَبَةِ الرِّجالِ.",
          num: 3,
        },

        {
          name: "اللهمَّ بكَ أصبَحنا, وبكَ أمسَينا, وبكَ نَحيا, وبكَ نَموتُ, وإليكَ النشور",
          num: "1", 
        },

        {
          name: "اللهمَّ إِنِّي أَسْأَلُكَ العافَيَةَ في الدُّنيا والآخِرَةِ, اللهمَّ أَسأَلُك العفوَ والعافِيةَ في دِيني ودُنْيايَ, وأَهْلي ومالي, اللهمَّ اسْتُرْ عَوْراتي, وآمِن رَوْعاتي, اللهمَّ احفَظْني مِن بين يدَيَّ ومِن خَلْفي, وعَن يميني, وعن شِمالي، ومِن فَوْقي, وأَعوذُ بعَظَمتِكَ أَنْ أُغْتالَ مِن تَحْتي ",
          num: 1,
        },


        {
          name: " أصبَحنا وأصبح الملْكُ للَّهِ ربِّ العالمينَ اللَّهمَّ إنِّي أسألُكَ خيرَ هذا اليومِ فتحَهُ ونصرَهُ ونورَهُ وبرَكتَهُ وَهداهُ وأعوذُ بِكَ من شرِّ ما فيهِ وشرِّ ما بعدَهُ",
          num: 1,
        },

        {
          name: "سُبحانَ اللهِ وبحمْدِه، لا قوَّةَ إلَّا باللهِ، ما شاءَ اللهُ كان، وما لم يشَأْ لم يكُنْ، أعلَمُ أنَّ اللهَ على كُلِّ شيءٍ قديرٌ، وأنَّ اللهَ قد أحاطَ بكلِّ شيءٍ عِلمًا",
          num: 1,
        },

        {
          name: " أصبَحنا على فطرةِ الإسلامِ, وكـلمةِ الإخلاص, ودين نبينا محمدٍ صلى الله عليه وسلم وملَّةِ أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين",
          num: 1,
        },

        {
          name: "أصبَحنا وأصبحَ المُلكُ للهِ عَزّ وجَلّ، والحمدُ للهِ، والكِبرياءُ والعَظَمَةُ للهِ، والخَلقُ والأمرُ والليلُ والنهارُ وما سَكَنَ فيهما للهِ تعالى؛ اللهُمَّ اجْعَلْ أوّلَ هذا النّهارِ صَلاحًا، وأوسطهُ نجاحًا، وآخرهُ فلاحًا، يا أرحمَ الرّاحمينَ",
          num: 1,
        },

        {
          name: "حَسْبِيَ اللَّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
          num: 7,
        },
        {
          name: " أعـُوذُ بكـلِمَاتِ اللهِ التَّامَّات من شرِّ ما خلَقَ",
          num: 3,
        },

        {
          name: " بِسمِ الله الذِي لا يَضُرُّ مَعَ اسمِهِ شَيءُ, في الأرْضِ ولا في السَّماءِ وهوَ السَّميعُ العليِمُ",
          num: 3,
        },



        {
          name: "اللَّهمَّ أنت ربِّي لا إلهَ إلَّا أنت عليك توكَّلتُ وأنت ربُّ العرشِ العظيمِ لا حولَ ولا قوَّةَ إلَّا باللهِ العليِّ العظيمِ ما شاء اللهُ كان وما لم يشَأْ لم يكُنْ أعلمُ أنَّ اللهَ على كلِّ شيءٍ قديرٌ وأنَّ اللهَ قد أحاط بكلِّ شيءٍ عِلمًا وأحصَى كلَّ شيءٍ عددًا اللَّهمَّ إنِّي أعوذُ بك من شرِّ نفسي ومن شرِّ كلِّ دابَّةٍ أنت آخِذٌ بناصيتِها إنَّ ربِّي على صراطٍ مستقيمٍ",
          num: 1,
        },




        {
          name: "اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلاَ تَكِلْنِي إِلَى نَفْسِى طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ",
          num: 3,
        },

        {
          name: "رضيت بالله ربا و بالاسلام دينا و بمحمد صلى الله عليه و سلم نبيا و رسولا",
          num: 3,
        },

        {
          name: "جزى الله عنا سيدنا محمد صلى الله عليه وسلم ماهو أهله",
          num: 3,
        },

        {
          name: "اللهم صل و سلم و بارك على سيدنا محمد",
          num: 10,
        },

        {
          name: "سُبحَـٰنَ رَبِّكَ رَبِّ العِزَّةِ عَمَّا یَصِفُونَ، وَسَلَـٰمٌ عَلَى المُرسَلِینَ، وَٱلحَمدُ لِلَّهِ رَبِّ ٱلعَـٰلَمِین ",
          num: 1,
        },
      ],
    };
  },
  methods: {
    SabahMasa() {
      var first_time = "16";
      var today = new Date();
      var now_time = today.getHours().toString();

      // if (now_time === first_time){

      if (now_time < 12) {
        // console.log('true', this.athkar[0])
        this.nahar = 0;
      } else if (now_time >= first_time) {
        // console.log('false', this.athkar[1])
        this.nahar = 1;
          
            // console.log(this.sabah[this.index].name.replace('أصبَحتُ', 'أمسيت'))

            // console.log(this.sabah[this.index].name.replace('أصبَحنا', 'أمسينا'))
const correction = {
  "أصبحتُ" : "أمسيتُ",
  "أصبح": "أمسى",
  "أصبَحنا": "أمسينا",
  "أمسَينا": "أصبحنا",
  "هذا اليوم": "هذه الليلة",
  "أصبَحتُ": "أمسيت",
  "النشور": "المصير",
  "فتحَهُ ونصرَهُ ونورَهُ وبرَكتَهُ وَهداهُ وأعوذُ بِكَ من شرِّ ما فيهِ وشرِّ ما بعدَهُ": "فتحَها ونصرها ونورَها وبرَكتَها وَهداها وأعوذُ بِكَ من شرِّ ما فيها وشرِّ ما بعدَها",
}

// let str = " أصبَحنا وأصبحَ الملْكُ للَّهِ ربِّ العالمينَ اللَّهمَّ إنِّي أسألُكَ خيرَ هذا اليومِ فتحَهُ ونصرَهُ ونورَهُ وبرَكتَهُ وَهداهُ وأعوذُ بِكَ من شرِّ ما فيهِ وشرِّ ما بعدَهُ";


// Object.keys(correction).forEach((key) => {
//   // str = str.replaceAll(key, correction[key]);
//   this.sabah[this.index].name = this.sabah[this.index].name.replaceAll(key, correction[key])

// });

// console.log(this.sabah[this.index].name);
            for (const object of this.sabah) {
              // this.sabah[this.index].name=  this.sabah[this.index].name.replaceAll('أصبَحتُ', 'أمسيت')
              Object.keys(correction).forEach((key) => {  
              object.name=  object.name.replaceAll(key, correction[key])
            // console.log(this.sabah[this.index].name.replace('أصبَحنا', 'أمسينا'))
              }
              
              );
              
            }



      } else {
        this.nahar = 2;
      }
    },
    next() {
      console.log("next", this.sabah[this.index].num);
      if (this.index <= this.sabah.length - 1 && this.sabah[this.index].num > 1) {
        for (const object of this.sabah) {
          if (object.num > 1 ) {
            // console.log("before");
            object.num = object.num - 1;
            // console.log(object.num);

            break;
          }
        }
      } else {
        this.index++;
      }
    },
    previous() {
      console.log("previous");

      // this.sabah.index --
      if (this.index <= 0) {
        return;
      }
      this.index--;
    },
  },
  mounted() {
    this.SabahMasa();
    // console.log("mounted app ");
  },
  computed: {
    IndexSabah() {
      return this.sabah[this.index];
    },
  },
}).mount("#app");
